# GetLayerDirection Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaReinforcement..::..GetLayerDirection Method
AreaReinforcement Class See Also
---
Gets the direction of the layer. The lines are distributed along this direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public XYZ GetLayerDirection(
	AreaReinforcementLayerType layer
)
```

Visual Basic
---
```text
Public Function GetLayerDirection ( _
	layer As AreaReinforcementLayerType _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetLayerDirection(
	AreaReinforcementLayerType layer
)
```

# ### Parameters
layer
    Type: Autodesk.Revit.DB.Structure..::..AreaReinforcementLayerType The layer type.
# ### Return Value
Returns the direction of the desired layer.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | The layer layer isn't active. |

# See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace